{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor": {"name": "keras_tensor:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "833"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4096"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "833"}, {"size": "4000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4000"}, {"size": "4000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4000"}, {"size": "4000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_3_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4000"}, {"size": "4000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_3_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_4_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4000"}, {"size": "4000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_4_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_5_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4000"}, {"size": "4096"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_5_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "833"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Relu", "op": "_FusedMatMul", "input": ["keras_tensor", "StatefulPartitionedCall/sequential_1/dense_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_1/Relu", "StatefulPartitionedCall/sequential_1/dense_1_2/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_1_2/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_1_2/Relu", "StatefulPartitionedCall/sequential_1/dense_2_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_2_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_3_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_2_1/Relu", "StatefulPartitionedCall/sequential_1/dense_3_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_3_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_4_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_3_1/Relu", "StatefulPartitionedCall/sequential_1/dense_4_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_4_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_5_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_4_1/Relu", "StatefulPartitionedCall/sequential_1/dense_5_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_5_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/dense_5_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of80.bin", "group1-shard2of80.bin", "group1-shard3of80.bin", "group1-shard4of80.bin", "group1-shard5of80.bin", "group1-shard6of80.bin", "group1-shard7of80.bin", "group1-shard8of80.bin", "group1-shard9of80.bin", "group1-shard10of80.bin", "group1-shard11of80.bin", "group1-shard12of80.bin", "group1-shard13of80.bin", "group1-shard14of80.bin", "group1-shard15of80.bin", "group1-shard16of80.bin", "group1-shard17of80.bin", "group1-shard18of80.bin", "group1-shard19of80.bin", "group1-shard20of80.bin", "group1-shard21of80.bin", "group1-shard22of80.bin", "group1-shard23of80.bin", "group1-shard24of80.bin", "group1-shard25of80.bin", "group1-shard26of80.bin", "group1-shard27of80.bin", "group1-shard28of80.bin", "group1-shard29of80.bin", "group1-shard30of80.bin", "group1-shard31of80.bin", "group1-shard32of80.bin", "group1-shard33of80.bin", "group1-shard34of80.bin", "group1-shard35of80.bin", "group1-shard36of80.bin", "group1-shard37of80.bin", "group1-shard38of80.bin", "group1-shard39of80.bin", "group1-shard40of80.bin", "group1-shard41of80.bin", "group1-shard42of80.bin", "group1-shard43of80.bin", "group1-shard44of80.bin", "group1-shard45of80.bin", "group1-shard46of80.bin", "group1-shard47of80.bin", "group1-shard48of80.bin", "group1-shard49of80.bin", "group1-shard50of80.bin", "group1-shard51of80.bin", "group1-shard52of80.bin", "group1-shard53of80.bin", "group1-shard54of80.bin", "group1-shard55of80.bin", "group1-shard56of80.bin", "group1-shard57of80.bin", "group1-shard58of80.bin", "group1-shard59of80.bin", "group1-shard60of80.bin", "group1-shard61of80.bin", "group1-shard62of80.bin", "group1-shard63of80.bin", "group1-shard64of80.bin", "group1-shard65of80.bin", "group1-shard66of80.bin", "group1-shard67of80.bin", "group1-shard68of80.bin", "group1-shard69of80.bin", "group1-shard70of80.bin", "group1-shard71of80.bin", "group1-shard72of80.bin", "group1-shard73of80.bin", "group1-shard74of80.bin", "group1-shard75of80.bin", "group1-shard76of80.bin", "group1-shard77of80.bin", "group1-shard78of80.bin", "group1-shard79of80.bin", "group1-shard80of80.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1/dense_1/Cast/ReadVariableOp", "shape": [833, 4000], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Add/ReadVariableOp", "shape": [4000], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Cast/ReadVariableOp", "shape": [4000, 4000], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Add/ReadVariableOp", "shape": [4000], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_2_1/Cast/ReadVariableOp", "shape": [4000, 4000], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_2_1/Add/ReadVariableOp", "shape": [4000], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_3_1/Cast/ReadVariableOp", "shape": [4000, 4000], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_3_1/Add/ReadVariableOp", "shape": [4000], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_4_1/Cast/ReadVariableOp", "shape": [4000, 4000], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_4_1/Add/ReadVariableOp", "shape": [4000], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_5_1/Cast/ReadVariableOp", "shape": [4000, 4096], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_5_1/Add/ReadVariableOp", "shape": [4096], "dtype": "float32"}]}]}