{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_10": {"name": "keras_tensor_10:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "833"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4096"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_4_1/dense_4_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "833"}, {"size": "10000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_4_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_5_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10000"}, {"size": "4096"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_5_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_10", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "833"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_4_1/Relu", "op": "_FusedMatMul", "input": ["keras_tensor_10", "StatefulPartitionedCall/sequential_4_1/dense_4_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_4_1/dense_4_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_5_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4_1/dense_4_1/Relu", "StatefulPartitionedCall/sequential_4_1/dense_5_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_4_1/dense_5_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_4_1/dense_5_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of48.bin", "group1-shard2of48.bin", "group1-shard3of48.bin", "group1-shard4of48.bin", "group1-shard5of48.bin", "group1-shard6of48.bin", "group1-shard7of48.bin", "group1-shard8of48.bin", "group1-shard9of48.bin", "group1-shard10of48.bin", "group1-shard11of48.bin", "group1-shard12of48.bin", "group1-shard13of48.bin", "group1-shard14of48.bin", "group1-shard15of48.bin", "group1-shard16of48.bin", "group1-shard17of48.bin", "group1-shard18of48.bin", "group1-shard19of48.bin", "group1-shard20of48.bin", "group1-shard21of48.bin", "group1-shard22of48.bin", "group1-shard23of48.bin", "group1-shard24of48.bin", "group1-shard25of48.bin", "group1-shard26of48.bin", "group1-shard27of48.bin", "group1-shard28of48.bin", "group1-shard29of48.bin", "group1-shard30of48.bin", "group1-shard31of48.bin", "group1-shard32of48.bin", "group1-shard33of48.bin", "group1-shard34of48.bin", "group1-shard35of48.bin", "group1-shard36of48.bin", "group1-shard37of48.bin", "group1-shard38of48.bin", "group1-shard39of48.bin", "group1-shard40of48.bin", "group1-shard41of48.bin", "group1-shard42of48.bin", "group1-shard43of48.bin", "group1-shard44of48.bin", "group1-shard45of48.bin", "group1-shard46of48.bin", "group1-shard47of48.bin", "group1-shard48of48.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_4_1/dense_4_1/Cast/ReadVariableOp", "shape": [833, 10000], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_4_1/Add/ReadVariableOp", "shape": [10000], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_5_1/Cast/ReadVariableOp", "shape": [10000, 4096], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_5_1/Add/ReadVariableOp", "shape": [4096], "dtype": "float32"}]}]}